# View Sheet Sheet Title Block Id Property

Source: https://www.revitapidocs.com/2026/c866285c-67c2-5536-cbf5-169c31247ab8.htm

---

| View Sheet Sheet Title Block Id Property |
| --- |

The Id of the title block this sheet is associated with.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public ElementId SheetTitleBlockId { get; set; }
```

```
Public Property SheetTitleBlockId As ElementId
	Get
	Set
```

```
public:
property ElementId^ SheetTitleBlockId {
	ElementId^ get ();
	void set (ElementId^ value);
}
```

```
member SheetTitleBlockId : ElementId with get, set
```

#### Property Value

ElementId Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non\-optional argument was null |

See Also

#### Reference

ViewSheet Class Autodesk.Revit.DB Namespace